In [68]:
import pandas as pd
from __future__ import division

Location = "titanic3.xls"
df = pd.read_excel(Location)
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [69]:
df_survived = df[df["survived"] == 1]
df_women = df[df["sex"] == 'female']
df_wealthy = df[df["pclass"] == 1]
df_old = df[df["age"] >= 60]

In [70]:
p_wo = len(df_women) / len(df)
p_we = len(df_wealthy) / len(df)
p_old = len(df_old) / len(df)

In [71]:
p_lived = len(df_survived) / len(df)

In [72]:
df_survivedwealthy = df_survived[df_survived["pclass"] ==1]
df_survivedwomen = df_survived[df_survived["sex"] == "female"]
df_survivedold = df_survived[df_survived["age"] >= 60]

In [73]:
p_we_l = len(df_survivedwealthy) / len(df_survived)
p_we_l

0.4

In [74]:
p_wo_l = len(df_survivedwomen) / len(df_survived)
p_wo_l

0.678

In [75]:
p_o_l = len(df_survivedold) / len(df_survived)
p_o_l

0.024

In [76]:
p_l = len(df_survived) / len(df)
p_l

0.3819709702062643

In [77]:
(p_we_l * p_wo_l * p_o_l * p_l) / (p_we * p_wo * p_old)

0.9261936390332054